{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "input_dtype": "float32", "name": "cropping2d_1", "cropping": [[70, 25], [0, 0]], "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "arguments": {}, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "lambda_1", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_1", "subsample": [4, 4], "b_constraint": null, "nb_row": 8, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_col": 8, "bias": true, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 16}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_2", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "bias": true, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 32}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "name": "convolution2d_3", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "bias": true, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "border_mode": "same", "nb_filter": 64}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "b_constraint": null, "output_dim": 512, "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "input_dim": 6400, "bias": true, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "b_constraint": null, "output_dim": 50, "name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "input_dim": 512, "bias": true, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "b_constraint": null, "output_dim": 1, "name": "dense_3", "b_regularizer": null, "init": "glorot_uniform", "input_dim": 50, "bias": true, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null}}]}